<template>
  <div class="vacation-list">
    <transition-group name="vac">
    <vacantionOffer v-for="(vac, index) in vacations" :key="index" :vacation="vac"></vacantionOffer>
  </transition-group>
  </div>
</template>

<script>
import vacantionOffer from "@/components/Vacations/vacantionOffer";
export default {
  name: "vacation-list",
  components: { vacantionOffer },
  props:{
    vacations:{
            type: Array,
            required: true
        }
  }
  // data() {
  //   return {
  //     vacations: [
  //       {
  //         name: "Питон разработчик",
  //         salary: "Зарплата договорная",
  //         desription:
  //           "Требуется Python-разработчик для работы в компании. Кандидат должен иметь опыт работы с языком программирования Python и знание основных библиотек и фреймворков. Основные обязанности включают разработку и поддержку программного обеспечения на Python, написание и отладку кода, тестирование и оптимизацию производительности.",
  //         skills: ["Биба", "боба", "python"],
  //       },
  //       {
  //         name: "Питон разработчик",
  //         salary: "Зарплата договорная",
  //         desription:
  //           "Требуется Python-разработчик для работы в компании. Кандидат должен иметь опыт работы с языком программирования Python и знание основных библиотек и фреймворков. Основные обязанности включают разработку и поддержку программного обеспечения на Python, написание и отладку кода, тестирование и оптимизацию производительности.",
  //         skills: ["Биба", "боба", "python"],
  //       },
  //       {
  //         name: "Питон разработчик",
  //         salary: "Зарплата договорная",
  //         desription:
  //           "Требуется Python-разработчик для работы в компании. Кандидат должен иметь опыт работы с языком программирования Python и знание основных библиотек и фреймворков. Основные обязанности включают разработку и поддержку программного обеспечения на Python, написание и отладку кода, тестирование и оптимизацию производительности.",
  //         skills: ["Биба", "боба", "python"],
  //       },
  //       {
  //         name: "Питон разработчик",
  //         salary: "Зарплата договорная",
  //         desription:
  //           "Требуется Python-разработчик для работы в компании. Кандидат должен иметь опыт работы с языком программирования Python и знание основных библиотек и фреймворков. Основные обязанности включают разработку и поддержку программного обеспечения на Python, написание и отладку кода, тестирование и оптимизацию производительности.",
  //         skills: ["Биба", "боба", "python"],
  //       },
  //       {
  //         name: "Питон разработчик",
  //         salary: "Зарплата договорная",
  //         desription:
  //           "Требуется Python-разработчик для работы в компании. Кандидат должен иметь опыт работы с языком программирования Python и знание основных библиотек и фреймворков. Основные обязанности включают разработку и поддержку программного обеспечения на Python, написание и отладку кода, тестирование и оптимизацию производительности.",
  //         skills: ["Биба", "боба", "python"],
  //       },
  //       {
  //         name: "Питон разработчик",
  //         salary: "Зарплата договорная",
  //         desription:
  //           "Требуется Python-разработчик для работы в компании. Кандидат должен иметь опыт работы с языком программирования Python и знание основных библиотек и фреймворков. Основные обязанности включают разработку и поддержку программного обеспечения на Python, написание и отладку кода, тестирование и оптимизацию производительности.",
  //         skills: ["Биба", "боба", "python"],
  //       },
  //     ],
  //   };
  // },
};
</script>

<style scoped>
.vacation-list{
  width: 100%;
  padding-bottom: 50px;
}

.vac-enter-active,
.vac-leave-active {
  transition: all 0.5s ease;
}
.vac-enter-from,
.vac-leave-to {
  opacity: 0;
  transform: translateX(-20%);
}
vac-move {
  transition: transform 0.4s;
}
</style>
