<template>
  <div class="vacation-list">
    <vacantionOffer v-for="(vac, index) in vacations" :key="index" :vacation="vac"></vacantionOffer>
  </div>
</template>

<script>
import vacantionOffer from "@/components/vacantionOffer";
export default {
  name: "vacation-list",
  components: { vacantionOffer },
  data() {
    return {
      vacations: [
        {
          name: "Питон разработчик",
          salary: "Зарплата договорная",
          desription:
            "Требуется Python-разработчик для работы в компании. Кандидат должен иметь опыт работы с языком программирования Python и знание основных библиотек и фреймворков. Основные обязанности включают разработку и поддержку программного обеспечения на Python, написание и отладку кода, тестирование и оптимизацию производительности.",
          skills: ["Биба", "боба", "python"],
        },
        {
          name: "Питон разработчик",
          salary: "Зарплата договорная",
          desription:
            "Требуется Python-разработчик для работы в компании. Кандидат должен иметь опыт работы с языком программирования Python и знание основных библиотек и фреймворков. Основные обязанности включают разработку и поддержку программного обеспечения на Python, написание и отладку кода, тестирование и оптимизацию производительности.",
          skills: ["Биба", "боба", "python"],
        },
        {
          name: "Питон разработчик",
          salary: "Зарплата договорная",
          desription:
            "Требуется Python-разработчик для работы в компании. Кандидат должен иметь опыт работы с языком программирования Python и знание основных библиотек и фреймворков. Основные обязанности включают разработку и поддержку программного обеспечения на Python, написание и отладку кода, тестирование и оптимизацию производительности.",
          skills: ["Биба", "боба", "python"],
        },
        {
          name: "Питон разработчик",
          salary: "Зарплата договорная",
          desription:
            "Требуется Python-разработчик для работы в компании. Кандидат должен иметь опыт работы с языком программирования Python и знание основных библиотек и фреймворков. Основные обязанности включают разработку и поддержку программного обеспечения на Python, написание и отладку кода, тестирование и оптимизацию производительности.",
          skills: ["Биба", "боба", "python"],
        },
        {
          name: "Питон разработчик",
          salary: "Зарплата договорная",
          desription:
            "Требуется Python-разработчик для работы в компании. Кандидат должен иметь опыт работы с языком программирования Python и знание основных библиотек и фреймворков. Основные обязанности включают разработку и поддержку программного обеспечения на Python, написание и отладку кода, тестирование и оптимизацию производительности.",
          skills: ["Биба", "боба", "python"],
        },
        {
          name: "Питон разработчик",
          salary: "Зарплата договорная",
          desription:
            "Требуется Python-разработчик для работы в компании. Кандидат должен иметь опыт работы с языком программирования Python и знание основных библиотек и фреймворков. Основные обязанности включают разработку и поддержку программного обеспечения на Python, написание и отладку кода, тестирование и оптимизацию производительности.",
          skills: ["Биба", "боба", "python"],
        },
      ],
    };
  },
};
</script>

<style scoped>
.vacation-list{
  width: 100%;
}
</style>
